#### ZoneEquipmentHvacType Enumeration

---

|  |
| --- |
| See Also |

The type of zone equipment.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum ZoneEquipmentHvacType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ZoneEquipmentHvacType ``` |

| Visual C++ |
| --- |
| ``` public enum class ZoneEquipmentHvacType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined |  |
| ChilledBeamActive |  |
| FourPipeFanCoil |  |
| PackagedTerminalAirConditioner |  |
| PackagedTerminalHeatPump |  |
| ParallelFanPoweredBox |  |
| VAVBox |  |
| CAVBox |  |
| RadiantPanel |  |
| SeriesFanPoweredBox |  |
| UnitHeater |  |
| UnitVentilator |  |
| WaterSourceHeatPump |  |
| ChilledBeamPassive |  |
| Unconditioned |  |
| VRFFanCoil |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace